In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {
    "Name":["Vighnesh","Suresh","Ritik","Devang"],
    "Marks":[99,78,58,65],
    "City":["Shahjahanpur","Khadharpur","Lazmi Nagar","Subhash"],
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

       Name  Marks          City
0  Vighnesh     99  Shahjahanpur
1    Suresh     78    Khadharpur
2     Ritik     58   Lazmi Nagar
3    Devang     65       Subhash

In [7]:
df.describe()

           Marks
count   4.000000
mean   75.000000
std    18.018509
min    58.000000
25%    63.250000
50%    71.500000
75%    83.250000
max    99.000000

In [8]:
df.to_csv('First-of-Pandas')

In [9]:
df.to_csv('First-of-Pandas_without_indexs', index=False )

In [10]:
Train=pd.read_csv('Train-Names.csv')

In [11]:
Train

   Unnamed: 0                    Train Name  Train No. City-From      City-To
0           1      Bareilly-Banaras-Express      14236  Bareilly     Varanasi
1           2           ShaktiNagar Triveni      15076  Tanakpur  Shaktinagar
2           3                 Bareilly-Roza      64176  Bareilly        Roza
3           4  Lucknow-Rajya Rani Superfast      22454    Meerut      Lucknow

In [12]:
Train['City-From']

0    Bareilly
1    Tanakpur
2    Bareilly
3      Meerut
Name: City-From, dtype: object

In [13]:
Train["Train Name"][0]= 'Bareilly-Banaras-Express'

/tmp/ipykernel_4601/1018625119.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Train["Train Name"][0]= 'Bareilly-Banaras-Express'
/tmp/ipykernel_4601/1018625119.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Train["Train Name"][0]= 'Bareilly-Banaras-Express'

In [14]:
Train

   Unnamed: 0                    Train Name  Train No. City-From      City-To
0           1      Bareilly-Banaras-Express      14236  Bareilly     Varanasi
1           2           ShaktiNagar Triveni      15076  Tanakpur  Shaktinagar
2           3                 Bareilly-Roza      64176  Bareilly        Roza
3           4  Lucknow-Rajya Rani Superfast      22454    Meerut      Lucknow

In [15]:
 Train.to_csv("Train-Names.csv",index = False)

In [16]:
Train.index = [1,2,3,4]

In [17]:
Train

   Unnamed: 0                    Train Name  Train No. City-From      City-To
1           1      Bareilly-Banaras-Express      14236  Bareilly     Varanasi
2           2           ShaktiNagar Triveni      15076  Tanakpur  Shaktinagar
3           3                 Bareilly-Roza      64176  Bareilly        Roza
4           4  Lucknow-Rajya Rani Superfast      22454    Meerut      Lucknow

In [18]:
Train.to_csv("Train-Names.csv")

In [19]:
n = open("WhatisNew.csv")

In [23]:
Train.drop("City-From",axis=1,inplace=True)

In [25]:
Train["City-From"]=["Bareilly","TanakPur","Bareilly","Meerut"]

In [26]:
Train

   Unnamed: 0                    Train Name  Train No. City-From
1           1      Bareilly-Banaras-Express      14236  Bareilly
2           2           ShaktiNagar Triveni      15076  TanakPur
3           3                 Bareilly-Roza      64176  Bareilly
4           4  Lucknow-Rajya Rani Superfast      22454    Meerut

In [27]:
Train.to_csv("Train-Names.csv",index = False)

In [28]:
Train["City-To"]=["Varanasi","Shaktinagar","Roza","Lucknow"]

In [29]:
Train

   Unnamed: 0                    Train Name  Train No. City-From      City-To
1           1      Bareilly-Banaras-Express      14236  Bareilly     Varanasi
2           2           ShaktiNagar Triveni      15076  TanakPur  Shaktinagar
3           3                 Bareilly-Roza      64176  Bareilly         Roza
4           4  Lucknow-Rajya Rani Superfast      22454    Meerut      Lucknow

In [30]:
Train.to_csv("Train-Names.csv",index = False)